![SolidQ](https://antoniosql.github.io/images/SolidQ_Verne.png)

# Codificación de Variables Categóricas

In [12]:
import pandas as pd
import sqlite3
import numpy as np

In [3]:
conn = sqlite3.connect('Tiendas24H.sqlite')
query = "SELECT * FROM Clientes"

df = pd.read_sql_query(query,conn)

df.head()

,index,CodCliente,Nombre,Apellidos,FechaNacimiento,EstadoCivil,Sexo,Email,IngresosAnuales,HijosACargo,NivelAcademico,Ocupacion
0,0,000020,Jon,Yang,1976-04-08,M,M,jon24@outlook.com,90000.0,0.0,4,5
1,1,000026,Eugene,Huang,1975-05-14,S,M,eugene10@outlook.com,60000.0,3.0,4,5
2,2,000029,Ruben,Torres,1975-08-12,M,M,ruben35@outlook.com,60000.0,3.0,4,5
3,3,000046,Christy,Zhu,1978-02-15,S,F,christy12@outlook.com,70000.0,0.0,4,5
4,4,000047,Elizabeth,Johnson,1978-08-08,S,F,elizabeth5@outlook.com,80000.0,5.0,4,5

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2441 entries, 0 to 2440
Data columns (total 12 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            2441 non-null   int64
 1   CodCliente       2441 non-null   object
 2   Nombre           2441 non-null   object
 3   Apellidos        2441 non-null   object
 4   FechaNacimiento  2441 non-null   object
 5   EstadoCivil      2440 non-null   object
 6   Sexo             2440 non-null   object
 7   Email            2440 non-null   object
 8   IngresosAnuales  2440 non-null   float64
 9   HijosACargo      2440 non-null   float64
 10  NivelAcademico   2441 non-null   int64
 11  Ocupacion        2441 non-null   int64
dtypes: float64(2), int64(3), object(7)
memory usage: 229.0+ KB

In [5]:
df.EstadoCivil.unique()

array(['M', 'S', None], dtype=object)

In [6]:
df.Sexo.unique()

array(['M', 'F', None], dtype=object)

In [7]:
df.isna().sum()

index              0
CodCliente         0
Nombre             0
Apellidos          0
FechaNacimiento    0
EstadoCivil        1
Sexo               1
Email              1
IngresosAnuales    1
HijosACargo        1
NivelAcademico     0
Ocupacion          0
dtype: int64

In [8]:
df.dropna(axis=0,inplace=True)

In [23]:
from sklearn.compose import ColumnTransformer 
from sklearn.preprocessing import  OneHotEncoder,LabelEncoder

#etiquetas = ['EstadoCivil', 'Sexo']
le=LabelEncoder()

#df_Etiquetado = df[etiquetas].apply(le.fit_transform)

df['EstadoCivil'] = le.fit_transform(df['EstadoCivil'])
df['Sexo'] = le.fit_transform(df['Sexo'])

In [24]:
df.head()

,index,CodCliente,Nombre,Apellidos,FechaNacimiento,EstadoCivil,Sexo,Email,IngresosAnuales,HijosACargo,NivelAcademico,Ocupacion
0,0,000020,Jon,Yang,1976-04-08,0,1,jon24@outlook.com,90000.0,0.0,4,5
1,1,000026,Eugene,Huang,1975-05-14,1,1,eugene10@outlook.com,60000.0,3.0,4,5
2,2,000029,Ruben,Torres,1975-08-12,0,1,ruben35@outlook.com,60000.0,3.0,4,5
3,3,000046,Christy,Zhu,1978-02-15,1,0,christy12@outlook.com,70000.0,0.0,4,5
4,4,000047,Elizabeth,Johnson,1978-08-08,1,0,elizabeth5@outlook.com,80000.0,5.0,4,5

In [13]:

categorias =['EstadoCivil','Sexo','NivelAcademico','Ocupacion']

columnTransformer = ColumnTransformer([('encoder', OneHotEncoder(), categorias)], remainder='passthrough')

dataset = np.array(columnTransformer.fit_transform(df), dtype = np.str)

In [14]:
dataset

array([['1.0', '0.0', '0.0', ..., 'jon24@outlook.com', '90000.0', '0.0'],
       ['0.0', '1.0', '0.0', ..., 'eugene10@outlook.com', '60000.0',
        '3.0'],
       ['1.0', '0.0', '0.0', ..., 'ruben35@outlook.com', '60000.0',
        '3.0'],
       ...,
       ['1.0', '0.0', '0.0', ..., 'ethan9@outlook.com', '90000.0', '0.0'],
       ['0.0', '1.0', '1.0', ..., 'chloe86@outlook.com', '90000.0',
        '0.0'],
       ['1.0', '0.0', '0.0', ..., 'arturo8@outlook.com', '110000.0',
        '2.0']], dtype='<U25')